app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
    def index
        events = Event.all

DELETE FROM "events" WHERE "events"."id" = $1  [["id", 39]]
---
    def destroy
        event = Event.destroy(params[:id])

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
UPDATE "events" SET "event_title" = $1, "image" = $2, "description" = $3 WHERE "events"."id" = $4  [["event_title", "Drag brunch 123"], ["image", "eafeavea"], ["description", "Let's sashay to the books! "], ["id", 35]]
---
    def update
        event = Event.find(params[:id])
        event.update(event_params)

INSERT INTO "events" ("event_title", "image", "description") VALUES ($1, $2, $3) RETURNING "id"  [["event_title", "Drag Story time ABC123"], ["image", "eafeaveafdasfda"], ["description", "Baby I was born this way!"]]
---
    def create
        event = Event.new(event_params)

        if event.save

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
---
    def show
        puts params
        event = Event.find(params[:id])